openfoam/NASA_hump_data_coarse4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       120892;
    }
    topWall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          608;
        startFace       120992;
    }
    jet
    {
        type            patch;
        nFaces          56;
        startFace       121600;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       121656;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          552;
        startFace       121756;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          121600;
        startFace       122308;
    }
)

// ************************************************************************* //
