openfoam/NASA_hump_data_coarse4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-6.39     0         0)   //0
    (-0.06     0         0)   //1 Bit upstream to smoothen the spline
    (-0.3      1         0)   //2 Changed
    (-6.39     1         0)   //3
    (0.654157  0.115013  0)   //4
    (0.97      1         0)   //5 Changed
    (0.658481  0.113582  0)   //6
    (0.98      1         0)   //7 Changed
    (0.654157  0.114408  0)   //8
    (0.655758  0.112948  0)   //9
    (0.547620 -0.060522  0)   //10
    (0.668573 -0.060522  0)   //11
    (1.06      0         0)   //12 Bit downstream to smoothen the spline
    (1.4       1         0)   //13 Changed
    (5         0         0)   //14
    (5         1         0)   //15
    (-6.39     0         0.1) //16
    (-0.06     0         0.1) //17 Bit upstream to smoothen the spline
    (-0.3      1         0.1) //18 Changed
    (-6.39     1         0.1) //19
    (0.654157  0.115013  0.1) //20
    (0.97      1         0.1) //21 Changed
    (0.658481  0.113582  0.1) //22
    (0.98      1         0.1) //23 Changed
    (0.654157  0.114408  0.1) //24
    (0.655758  0.112948  0.1) //25
    (0.547620 -0.060522  0.1) //26
    (0.668573 -0.060522  0.1) //27
    (1.06      0         0.1) //28 Bit downstream to smoothen the spline
    (1.4       1         0.1) //29 Changed
    (5         0         0.1) //30
    (5         1         0.1) //31
    (-5        0         0)   //32 To correct inlet singularities
    (-5        1         0)   //33 To correct inlet singularities
    (-5        0         0.1) //34 To correct inlet singularities
    (-5        1         0.1) //35 To correct inlet singularities
);

blocks
(
    // 0
    hex (0 32 33 3 16 34 35 19) (8 50 1) 
    simpleGrading (20 8000 1)

    // 0
    hex (32 1 2 33 34 17 18 35) (24 50 1) 
    simpleGrading (0.05 8000 1)

    // 1
    hex (1 4 5 2 17 20 21 18)   (100 50 1) 
    simpleGrading 
    (
        (
            (0.4 0.3 4)
            (0.6 0.7 0.01)
        )
        //0.01
        8000 
        1
    )

    // 2
    hex (4 6 7 5 20 22 23 21)   (28 50 1) 
    simpleGrading 
    (
        1
        8000 
        1
    )

    // 3
    hex (6 12 13 7 22 28 29 23)  (120 50 1) 
    simpleGrading 
    (
        40
        8000 
        1
    )

    // 4
    hex (12 14 15 13 28 30 31 29) (24 50 1) 
    simpleGrading (40 8000 1)
);

edges
(
    spline 1 4
    (
        #include "include/coords1"
    )
    spline 6 12
    (
        #include "include/coords5"
    )
    spline 17 20
    (
        #include "include/coords10"
    )
    spline 22 28
    (
        #include "include/coords50"
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 0 16 19)
        );
    }
    topWall
    {
        type symmetry;
        faces
        (
            (33 3 19 35) 
            (2 33 35 18)
            (5 2 18 21)
            (7 5 21 23)
            (13 7 23 29)
            (15 13 29 31)
        );
    }
    jet
    {
        type patch;
        faces
        (
            (4 6 22 20)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 15 31 30)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 32 34 16)
            (32 1 17 34)
            (1 4 20 17)
            (6 12 28 22)
            (12 14 30 28)
        );
    }
    defaultFaces
    {
        type empty;
        faces
        (
            (0 3 33 32)
            (32 33 2 1)
            (1 2 5 4)
            (4 5 7 6)
            (6 7 13 12)
            (12 13 15 14)
            //
            (16 34 35 19)
            (34 17 18 35)
            (17 20 21 18)
            (20 22 23 21)
            (22 28 29 23)
            (28 30 31 29)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
